{
  "_name_or_path": "Llabres/DocT5-ocr-base",
  "architectures": [
    "DocT5ForConditionalGeneration"
  ],
  "auto_map": {
    "AutoConfig": "configuration_doct5.DocT5Config",
    "AutoModelForCausalLM": "modeling_doct5.DocT5ForConditionalGeneration"
  },
  "classifier_dropout": 0.0,
  "d_ff": 2048,
  "d_kv": 64,
  "d_model": 768,
  "decoder_start_token_id": 0,
  "dense_act_fn": "gelu_new",
  "dropout_rate": 0.1,
  "eos_token_id": 1,
  "feed_forward_proj": "gated-gelu",
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "is_gated_act": true,
  "layer_norm_epsilon": 1e-06,
  "model_type": "doct5",
  "n_positions": 512,
  "num_decoder_layers": 12,
  "num_heads": 12,
  "num_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "patch_size": {
    "height": 16,
    "width": 16
  },
  "random_patch_removal": 0.1,
  "relative_attention_max_distance": 128,
  "relative_attention_num_buckets": 32,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.47.0",
  "use_cache": true,
  "vocab_size": 32128
}
